package com.codingvictor.newhope.constant;

public class ParamArray {
	
    public final static String[] COMPANY_TYPE = {
    	/*  0 */	"服务", "食品", "餐旅", "金融", "贸易",
    	/*  5 */	"娱乐", "矿业", "综合企业", "能源资源", "科技",
    	/* 10 */	"交通运输", "农业公司", "地产", "卫生保健", "公证行",
    	/* 15 */	"外包", "医院", "媒体", "市场营销", "废物", 
    	/* 20 */	"批发商", "拍卖行", "教育", "文化娱乐", "旅游",
    	/* 25 */	"检测认证", "气象", "营造", "政府机构", "司法机关",
    	/* 30 */	"制造", "零售商", "顾问", "环保"		
    };
    
    public final static String[] GENDER = {"女", "男", "其他"};
    
    public final static String[] COUNTRY = {
    	/*  0 */	"中国大陆", "中国台湾", "中国香港", "中国澳门", "美国",
    	/*  5 */	"日本", "英国", "意大利", "法国", "德国",
    	/* 10 */	"韩国", "加拿大", "澳大利亚", "新西兰", "印度",
    	/* 15 */	"巴西", "南非", "荷兰", "瑞典", "丹麦",
    	/* 20 */	"以色列", "俄罗斯", "印度尼西亚", "泰国", "越南",
    	/* 25 */	"马来西亚", "新加坡", "沙特阿拉伯", "阿联酋", "巴基斯坦",
    	/* 30 */	"伊朗"
    };
    
    public final static String[] PROVINCE_OF_CHINA = {
    	/*  0 */	"河北省", "山西省", "吉林省", "辽宁省", "黑龙江省",
    	/*  5 */	"陕西省", "甘肃省", "青海省", "山东省", "福建省",
    	/* 10 */	"浙江省", "河南省", "湖北省", "湖南省", "江西省",
    	/* 15 */	"江苏省", "安徽省", "广东省", "海南省", "四川省",
    	/* 20 */	"贵州省", "云南省", "北京市", "上海市", "天津市",
    	/* 25 */	"重庆市", "内蒙古自治区", "新疆维吾尔自治区", "宁夏回族自治区",
    	/* 30 */	"广西壮族自治区", "西藏自治区"
    };
}

